BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/Atmel.ATtiny_DFP.pdsc
         <device Dname="ATtiny1617">
            <processor Dcore="AVR8X"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iotn1617.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATtiny1617.atdf"/>
                  <at:variant ordercode="ATtiny1617-MFR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:variant ordercode="ATtiny1617-MNR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:memory exec="0"
                             name="EEPROM"
                             pagesize="0x20"
                             rw="RW"
                             size="0x0100"
                             start="0x00001400"
                             type="eeprom"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="FUSES"
                             pagesize="0x20"
                             rw="RW"
                             size="0xA"
                             start="0x00001280"
                             type="fuses"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="INTERNAL_SRAM"
                             rw="RW"
                             size="0x0800"
                             start="0x3800"
                             type="ram"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="IO"
                             rw="RW"
                             size="0x1100"
                             start="0x00000000"
                             type="io"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="LOCKBITS"
                             pagesize="0x20"
                             rw="RW"
                             size="0x1"
                             start="0x0000128A"
                             type="lockbits"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="MAPPED_PROGMEM"
                             pagesize="0x40"
                             rw="R"
                             size="0x4000"
                             start="0x00008000"
                             type="other"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="PROD_SIGNATURES"
                             pagesize="0x40"
                             rw="R"
                             size="0x3D"
                             start="0x00001103"
                             type="signatures"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="SIGNATURES"
                             pagesize="0x40"
                             rw="R"
                             size="0x3"
                             start="0x00001100"
                             type="signatures"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="USER_SIGNATURES"
                             pagesize="0x20"
                             rw="RW"
                             size="0x20"
                             start="0x00001300"
                             type="user_signatures"
                             address-space="data"/>
                  <at:memory exec="1"
                             name="PROGMEM"
                             pagesize="0x40"
                             rw="RW"
                             size="0x4000"
                             start="0x00000000"
                             type="flash"
                             address-space="prog"/>
                  <at:interface type="updi" name="UPDI"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATTINY1617"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libattinyxc.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libattinyxc.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="attiny1617"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="studio" component="Atmel Studio" version="7.0.1585"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/ATtiny1617.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATtiny1617"
                  title="Device page for ATtiny1617"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATtiny1617"
                  title="Datasheet"/>
         </device>
         <device Dname="ATtiny1616">
            <processor Dcore="AVR8X"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iotn1616.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATtiny1616.atdf"/>
                  <at:variant ordercode="ATtiny1616-MFR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:variant ordercode="ATtiny1616-MNR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:variant ordercode="ATtiny1616-SFR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:variant ordercode="ATtiny1616-SNR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="105"/>
                  <at:memory exec="0"
                             name="EEPROM"
                             pagesize="0x20"
                             rw="RW"
                             size="0x0100"
                             start="0x00001400"
                             type="eeprom"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="FUSES"
                             pagesize="0x20"
                             rw="RW"
                             size="0xA"
                             start="0x00001280"
                             type="fuses"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="INTERNAL_SRAM"
                             rw="RW"
                             size="0x0800"
                             start="0x3800"
                             type="ram"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="IO"
                             rw="RW"
                             size="0x1100"
                             start="0x00000000"
                             type="io"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="LOCKBITS"
                             pagesize="0x20"
                             rw="RW"
                             size="0x1"
                             start="0x0000128A"
                             type="lockbits"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="MAPPED_PROGMEM"
                             pagesize="0x40"
                             rw="R"
                             size="0x4000"
                             start="0x00008000"
                             type="other"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="PROD_SIGNATURES"
                             pagesize="0x40"
                             rw="R"
                             size="0x3D"
                             start="0x00001103"
                             type="signatures"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="SIGNATURES"
                             pagesize="0x40"
                             rw="R"
                             size="0x3"
                             start="0x00001100"
                             type="signatures"
                             address-space="data"/>
                  <at:memory exec="0"
                             name="USER_SIGNATURES"
                             pagesize="0x20"
                             rw="RW"
                             size="0x20"
                             start="0x00001300"
                             type="user_signatures"
                             address-space="data"/>
                  <at:memory exec="1"
                             name="PROGMEM"
                             pagesize="0x40"
                             rw="RW"
                             size="0x4000"
                             start="0x00000000"
                             type="flash"
                             address-space="prog"/>
                  <at:interface type="updi" name="UPDI"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATTINY1616"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libattinyxc.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libattinyxc.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="attiny1616"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="studio" component="Atmel Studio" version="7.0.1585"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/ATtiny1616.PIC"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATtiny1616"
                  title="Device page for ATtiny1616"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATtiny1616"
                  title="Datasheet"/>
         </device>
