BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/Atmel.ATtiny_DFP.pdsc
         <device Dname="ATtiny10">
            <processor Dcore="AVR8L"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iotn10.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATtiny10.atdf"/>
                  <at:variant ordercode="ATtiny10-TSHR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATtiny10-MAHR"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="ATtiny10-TS8R"
                              vccmin="1.8"
                              vccmax="5.5"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:memory start="0x0000"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x80"
                             address-space="prog"/>
                  <at:memory type="io"
                             size="0x40"
                             start="0x0000"
                             name="IO"
                             address-space="data"/>
                  <at:memory type="ram"
                             size="0x20"
                             start="0x0040"
                             name="SRAM"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0002"
                             start="0x3F00"
                             name="MAPPED_NVM_LOCK_BITS"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0002"
                             start="0x3F40"
                             name="MAPPED_CONFIGURATION_BITS"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0002"
                             start="0x3F80"
                             name="MAPPED_CALIBRATION_BITS"
                             address-space="data"/>
                  <at:memory type="sysreg"
                             size="0x0004"
                             start="0x3FC0"
                             name="MAPPED_DEVICE_ID_BITS"
                             address-space="data"/>
                  <at:memory type="flash"
                             start="0x4000"
                             name="MAPPED_FLASH"
                             size="0x0400"
                             address-space="data"/>
                  <at:interface type="tpi" name="TPI"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.ispmk2"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:tool id="com.atmel.avrdbg.tool.simulator"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.key" value="ATtiny10"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.win32"
                               value="simulator/win32/libattiny10.dll"/>
                  <at:property name="com.atmel.avrdbg.tool.simulator.model.linux64"
                               value="simulator/linux64/libattiny10.so"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="attiny10"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/ATtiny10.PIC"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 1KB Flash, 6/8-pin, ADC</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATtiny10"
                  title="Device page for ATtiny10"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATtiny10"
                  title="Datasheet"/>
         </device>
         <device Dname="ATtiny11">
            <processor Dcore="AVR8"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"/>
            <compile header="include/avr/iotn11.h"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0">
                  <at:atdf name="atdf/ATtiny11.atdf"/>
                  <at:variant ordercode="standard"
                              vccmin="2.7"
                              vccmax="5.5"
                              tempmin="0"
                              tempmax="0"/>
                  <at:memory start="0x0000"
                             size="0x0400"
                             type="flash"
                             rw="RW"
                             exec="1"
                             name="FLASH"
                             pagesize="0x00"
                             address-space="prog"/>
                  <at:memory external="false"
                             type="regs"
                             size="0x0020"
                             start="0x0000"
                             name="REGISTERS"
                             address-space="data"/>
                  <at:memory name="MAPPED_IO"
                             start="0x0020"
                             size="0x0040"
                             type="io"
                             external="false"
                             address-space="data"/>
                  <at:interface type="hvsp" name="HVSP"/>
                  <at:tool id="com.atmel.avrdbg.tool.avrdragon"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk500"/>
                  <at:tool id="com.atmel.avrdbg.tool.stk600"/>
                  <at:property name="com.atmel.gcc.options.mmcu" value="attiny11"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone AVRASM Project">
                     <at:component Cvendor="Atmel" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.asm)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="AVR8-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="AVRASM" component="AVRASM"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0">
                  <mchp:pic name="edc/ATtiny11.PIC"/>
               </mchp:extension>
            </environment>
            <description>8-bit AVR Microcontroller, 1KB Flash, 8-pin</description>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=ATtiny11"
                  title="Device page for ATtiny11"/>
            <book name="https://www.microchip.com/wwwproducts/productds/ATtiny11"
                  title="Datasheet"/>
         </device>
