BsAtHome/atpack/Atmel.ATtiny_DFP.atpack/Atmel.ATtiny_DFP.pdsc
      <condition id="ATtiny87">
         <require Dvendor="Atmel:3" Dname="ATtiny87"/>
      </condition>
      <condition id="ATtiny104">
         <require Dvendor="Atmel:3" Dname="ATtiny104"/>
      </condition>
      <condition id="ATtiny4313">
         <require Dvendor="Atmel:3" Dname="ATtiny4313"/>
      </condition>
      <condition id="ATtiny88">
         <require Dvendor="Atmel:3" Dname="ATtiny88"/>
      </condition>
      <condition id="ATtiny202">
         <require Dvendor="Atmel:3" Dname="ATtiny202"/>
      </condition>
      <condition id="ATtiny204">
         <require Dvendor="Atmel:3" Dname="ATtiny204"/>
      </condition>
      <condition id="ATtiny861">
         <require Dvendor="Atmel:3" Dname="ATtiny861"/>
      </condition>
      <condition id="ATtiny261">
         <require Dvendor="Atmel:3" Dname="ATtiny261"/>
      </condition>
      <condition id="ATtiny44A">
         <require Dvendor="Atmel:3" Dname="ATtiny44A"/>
      </condition>
      <condition id="ATtiny167">
         <require Dvendor="Atmel:3" Dname="ATtiny167"/>
      </condition>
      <condition id="ATtiny5">
         <require Dvendor="Atmel:3" Dname="ATtiny5"/>
      </condition>
      <condition id="ATtiny25">
         <require Dvendor="Atmel:3" Dname="ATtiny25"/>
      </condition>
      <condition id="ATtiny84A">
         <require Dvendor="Atmel:3" Dname="ATtiny84A"/>
      </condition>
      <condition id="ATtiny861A">
         <require Dvendor="Atmel:3" Dname="ATtiny861A"/>
      </condition>
      <condition id="ATtiny84">
         <require Dvendor="Atmel:3" Dname="ATtiny84"/>
      </condition>
      <condition id="ATtiny3217">
         <require Dvendor="Atmel:3" Dname="ATtiny3217"/>
      </condition>
      <condition id="ATtiny3216">
         <require Dvendor="Atmel:3" Dname="ATtiny3216"/>
      </condition>
      <condition id="ATtiny2313A">
         <require Dvendor="Atmel:3" Dname="ATtiny2313A"/>
      </condition>
      <condition id="ATtiny3214">
         <require Dvendor="Atmel:3" Dname="ATtiny3214"/>
      </condition>
      <condition id="ATtiny814">
         <require Dvendor="Atmel:3" Dname="ATtiny814"/>
      </condition>
      <condition id="ATtiny817">
         <require Dvendor="Atmel:3" Dname="ATtiny817"/>
      </condition>
      <condition id="ATtiny816">
         <require Dvendor="Atmel:3" Dname="ATtiny816"/>
      </condition>
      <condition id="ATtiny1634">
         <require Dvendor="Atmel:3" Dname="ATtiny1634"/>
      </condition>
      <condition id="ATtiny15">
         <require Dvendor="Atmel:3" Dname="ATtiny15"/>
      </condition>
      <condition id="ATtiny12">
         <require Dvendor="Atmel:3" Dname="ATtiny12"/>
      </condition>
      <condition id="ATtiny1614">
         <require Dvendor="Atmel:3" Dname="ATtiny1614"/>
      </condition>
      <condition id="ATtiny1617">
         <require Dvendor="Atmel:3" Dname="ATtiny1617"/>
      </condition>
      <condition id="ATtiny1616">
         <require Dvendor="Atmel:3" Dname="ATtiny1616"/>
      </condition>
      <condition id="ATtiny406">
         <require Dvendor="Atmel:3" Dname="ATtiny406"/>
      </condition>
      <condition id="ATtiny461">
         <require Dvendor="Atmel:3" Dname="ATtiny461"/>
      </condition>
      <condition id="ATtiny404">
         <require Dvendor="Atmel:3" Dname="ATtiny404"/>
      </condition>
      <condition id="ATtiny841">
         <require Dvendor="Atmel:3" Dname="ATtiny841"/>
      </condition>
      <condition id="ATtiny402">
         <require Dvendor="Atmel:3" Dname="ATtiny402"/>
      </condition>
      <condition id="ATtiny13">
         <require Dvendor="Atmel:3" Dname="ATtiny13"/>
      </condition>
      <condition id="ATtiny441">
         <require Dvendor="Atmel:3" Dname="ATtiny441"/>
      </condition>
      <condition id="ATtiny10">
         <require Dvendor="Atmel:3" Dname="ATtiny10"/>
      </condition>
      <condition id="ATtiny11">
         <require Dvendor="Atmel:3" Dname="ATtiny11"/>
      </condition>
      <condition id="ATtiny828">
         <require Dvendor="Atmel:3" Dname="ATtiny828"/>
      </condition>
      <condition id="ATtiny214">
         <require Dvendor="Atmel:3" Dname="ATtiny214"/>
      </condition>
      <condition id="ATtiny212">
         <require Dvendor="Atmel:3" Dname="ATtiny212"/>
      </condition>
      <condition id="ATtiny4">
         <require Dvendor="Atmel:3" Dname="ATtiny4"/>
      </condition>
      <condition id="ATtiny261A">
         <require Dvendor="Atmel:3" Dname="ATtiny261A"/>
      </condition>
      <condition id="ATtiny461A">
         <require Dvendor="Atmel:3" Dname="ATtiny461A"/>
      </condition>
      <condition id="ATtiny807">
         <require Dvendor="Atmel:3" Dname="ATtiny807"/>
      </condition>
      <condition id="ATtiny45">
         <require Dvendor="Atmel:3" Dname="ATtiny45"/>
      </condition>
      <condition id="ATtiny44">
         <require Dvendor="Atmel:3" Dname="ATtiny44"/>
      </condition>
      <condition id="ATtiny26">
         <require Dvendor="Atmel:3" Dname="ATtiny26"/>
      </condition>
      <condition id="ATtiny416">
         <require Dvendor="Atmel:3" Dname="ATtiny416"/>
      </condition>
      <condition id="ATtiny806">
         <require Dvendor="Atmel:3" Dname="ATtiny806"/>
      </condition>
      <condition id="ATtiny40">
         <require Dvendor="Atmel:3" Dname="ATtiny40"/>
      </condition>
      <condition id="ATtiny804">
         <require Dvendor="Atmel:3" Dname="ATtiny804"/>
      </condition>
      <condition id="ATtiny24A">
         <require Dvendor="Atmel:3" Dname="ATtiny24A"/>
      </condition>
      <condition id="ATtiny48">
         <require Dvendor="Atmel:3" Dname="ATtiny48"/>
      </condition>
      <condition id="ATtiny2313">
         <require Dvendor="Atmel:3" Dname="ATtiny2313"/>
      </condition>
      <condition id="ATtiny20">
         <require Dvendor="Atmel:3" Dname="ATtiny20"/>
      </condition>
      <condition id="ATtiny1606">
         <require Dvendor="Atmel:3" Dname="ATtiny1606"/>
      </condition>
      <condition id="ATtiny1607">
         <require Dvendor="Atmel:3" Dname="ATtiny1607"/>
      </condition>
      <condition id="ATtiny1604">
         <require Dvendor="Atmel:3" Dname="ATtiny1604"/>
      </condition>
      <condition id="ATtiny24">
         <require Dvendor="Atmel:3" Dname="ATtiny24"/>
      </condition>
      <condition id="ATtiny414">
         <require Dvendor="Atmel:3" Dname="ATtiny414"/>
      </condition>
